week-6/day-4/bbq/app/controllers/barbecues_controller.rb

SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC
---
  def index
    @barbecues = Barbecue.order(:date)

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]
---
  def get_api
    barbecue = Barbecue.find(params[:id])

INSERT INTO "barbecues" ("title", "venue", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mamma's BBQ"], ["venue", "The Stonehenge"], ["date", "2016-09-22 00:00:00.000000"], ["created_at", "2016-09-22 18:43:04.082469"], ["updated_at", "2016-09-22 18:43:04.082469"]]
---
  def create
    bbq_params = params.require(:barbecue).permit(:title, :venue, :date)
    @bbq = Barbecue.new(bbq_params)

    unless @bbq.save